In [11]:
#importing dataset
dataset = read.csv('Data.csv')

In [12]:
head(dataset, 10)

   Country Age Salary Purchased
1  France  44  72000  No
2  Spain   27  48000  Yes
3  Germany 30  54000  No
4  Spain   38  61000  No
5  Germany 40     NA  Yes
6  France  35  58000  Yes
7  Spain   NA  52000  No
8  France  48  79000  Yes
9  Germany 50  83000  No
10 France  37  67000  Yes

In [13]:
#dealing with missing values
dataset$Age = ifelse(is.na(dataset$Age),
                     ave(dataset$Age, FUN = function(x) mean(x, na.rm = TRUE)),
                     dataset$Age)
dataset$Salary = ifelse(is.na(dataset$Salary),
                        ave(dataset$Salary, FUN = function(x) mean(x, na.rm = TRUE)),
                        dataset$Salary)

In [14]:
head(dataset, 10)

   Country Age      Salary   Purchased
1  France  44.00000 72000.00 No
2  Spain   27.00000 48000.00 Yes
3  Germany 30.00000 54000.00 No
4  Spain   38.00000 61000.00 No
5  Germany 40.00000 63777.78 Yes
6  France  35.00000 58000.00 Yes
7  Spain   38.77778 52000.00 No
8  France  48.00000 79000.00 Yes
9  Germany 50.00000 83000.00 No
10 France  37.00000 67000.00 Yes

#### Here above table replace missing value with mean of the column

In [15]:
#Encoding Categorical data (C is a vector)
dataset$Country = factor(dataset$Country,
                         levels = c('France', 'Spain', 'Germany'),
                         labels = c(1, 2, 3))
dataset$Purchased = factor(dataset$Purchased,
                           levels = c('Yes', 'No'),
                           labels = c(1, 0))

In [16]:
head(dataset, 10)

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  3       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  3       40.00000 63777.78 1
6  1       35.00000 58000.00 1
7  2       38.77778 52000.00 0
8  1       48.00000 79000.00 1
9  3       50.00000 83000.00 0
10 1       37.00000 67000.00 1

In [18]:
##splitting dataset into training and test set
# install.packages('caTools')
library(caTools)
set.seed(123)
split = sample.split(dataset$Purchased, SplitRatio = 0.8)
training_set = subset (dataset, split == TRUE)
test_set     = subset (dataset, split == FALSE)

In [19]:
head(training_set)
head(test_set)

   Country Age      Salary   Purchased
1  1       44.00000 72000.00 0
2  2       27.00000 48000.00 1
3  3       30.00000 54000.00 0
4  2       38.00000 61000.00 0
5  3       40.00000 63777.78 1
7  2       38.77778 52000.00 0
8  1       48.00000 79000.00 1
10 1       37.00000 67000.00 1

  Country Age Salary Purchased
6 1       35  58000  1
9 3       50  83000  0

In [20]:
#Feature Scaling
training_set = scale(training_set)
test_set = scale(test_set)

ERROR: Error in colMeans(x, na.rm = TRUE): 'x' must be numeric

### The error is because we factor country and age so it iss not a numeric type

In [22]:
#Feature Scaling
training_set[, 2:3] = scale(training_set[, 2:3])
test_set[, 2:3] = scale(test_set[, 2:3])

In [23]:
head(training_set)
head(test_set)

  Country Age         Salary     Purchased
1 1        0.90101716  0.9392746 0
2 2       -1.58847494 -1.3371160 1
3 3       -1.14915281 -0.7680183 0
4 2        0.02237289 -0.1040711 0
5 3        0.31525431  0.1594000 1
7 2        0.13627122 -0.9577176 0

  Country Age        Salary     Purchased
6 1       -0.7071068 -0.7071068 1
9 3        0.7071068  0.7071068 0